<template>
  <PageWithScroll>
    <template #header>
      <RouterLink :to="{name: 'plan'}" custom v-slot="{ navigate }">
        <div class="back" @click="navigate">
          <div class="back-arrow">
            <i class="icon icon-ic_fluent_arrow_left_20_regular"></i>
          </div>
          <span class="back-subtitle">Назад</span>
        </div>
      </RouterLink>

      <h2 class="page-title">Политика конфиденциальности</h2>

    </template>
        <template #content>
  <div class="policy-privacy">

    <div class="policy-privacy-wrapper">
      <div class="policy-privacy-subtitle">1. ОБЩИЕ ПОЛОЖЕНИЯ</div>
      <p class="policy-privacy-text">
        1.1 Настоящая Политика конфиденциальности персональных данных (далее –
        Политика конфиденциальности) действует в отношении всей информации,
        которую оператор {{ project }}, «НИИ КС имени А.А. Максимова» - филиал
        АО «ГКНПЦ им. М.В. Хруничева» (далее – оператор) может получить о
        Пользователе во время использования.
      </p>

      <p class="policy-privacy-text">
        1.2 Политика конфиденциальности разработана в целях обеспечения
        реализации требований законодательства Российской Федерации в области
        обработки персональных данных, направленного на обеспечение защиты прав
        и свобод человека и гражданина при обработке его персональных данных, в
        том числе защиты прав на неприкосновенность частной жизни, личную и
        семейную тайну, в частности в целях защиты от несанкционированного
        доступа и неправомерного распространения персональных данных.
      </p>

      <p class="policy-privacy-text">
        1.3 В настоящей Политике используются следующие термины и определения:
      </p>

      <p class="policy-privacy-text">
        — персональные данные (ПДн) — любая информация, относящаяся к прямо или
        косвенно определенному или определяемому физическому лицу (субъекту
        ПДн);
      </p>

      <p class="policy-privacy-text">
        — пользователь — лицо, имеющее доступ к {{ project }}, посредством сети
        Интернет и использующее информацию и материалы {{ project }};
      </p>

      <p class="policy-privacy-text">
        — конфиденциальность персональных данных - обязательное для соблюдения
        Оператором или иным получившим доступ к персональным данным лицом
        требование не допускать их распространения без согласия субъекта
        персональных данных или наличия иного законного основания;
      </p>

      <p class="policy-privacy-text">
        — оператор — юридическое лицо, осуществляющее обработку ПДн, а также
        определяющее цели обработки ПДн, состав ПДн, подлежащих обработке,
        действия (операции), совершаемые с ПДн;
      </p>

      <p class="policy-privacy-text">
        — обработка ПДн — любое действие (операция) или совокупность действий
        (операций),совершаемых с использованием средств автоматизации или без
        использования таких средств с ПДн, включая сбор, запись, систематизацию,
        накопление, хранение, уточнение (обновление, изменение), извлечение,
        использование, передачу (распространение, предоставление, доступ),
        обезличивание, блокирование, удаление, уничтожение ПДн;
      </p>

      <p class="policy-privacy-text">
        — уничтожение ПДн — действия, в результате которых становится
        невозможным восстановить содержание ПДн в ИСПДн и/или в результате
        которых уничтожаются материальные носители ПДн;
      </p>
    </div>

    <div class="policy-privacy-wrapper">
      <div class="policy-privacy-subtitle">
        2. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ СУБЪЕКТОВ
      </div>

      <p class="policy-privacy-text">
        2.1 Оператор осуществляет обработку персональных данных в следующих
        целях:
      </p>
      <ul>
        <li>
          <p class="policy-privacy-text">
            осуществление деятельности, предусмотренной Уставом оператора и
            действующим законодательством Российской Федерации;
          </p>
        </li>

        <li>
          <p class="policy-privacy-text">
            рассмотрение обращений в службу технической поддержки субъектов;
          </p>
        </li>

        <li>
          <p class="policy-privacy-text">для обратной связи</p>
        </li>

        <li>
          <p class="policy-privacy-text">
            предоставление субъекту эффективную техническую поддержку при
            возникновении проблем.
          </p>
        </li>
      </ul>
    </div>

    <div class="policy-privacy-wrapper">
      <div class="policy-privacy-subtitle">
        3. СОСТАВ ПДН, ОБРАБАТЫВАЕМЫХ в {{ project }}
      </div>

      <p class="policy-privacy-text">
        3.1. Перечень персональных данных, обрабатываемых оператором,
        определяется в соответствии с законодательством Российской Федерации и
        локальными нормативными актами с учетом целей обработки персональных
        данных, указанных в разделе 2 Политики.
      </p>

      <p class="policy-privacy-text">
        3.2. Обработка специальных категорий персональных данных, касающихся
        расовой, национальной принадлежности, политических взглядов, религиозных
        или философских убеждений, в {{ project }} не осуществляется.
      </p>

      <p class="policy-privacy-text">
        3.3. Оператор не осуществляет обработку биометрических персональных
        данных (сведения, которые характеризуют физиологические и биологические
        особенности человека, на основании которых можно установить его
        личность).
      </p>

      <p class="policy-privacy-text">
        3.4 В ПК КАТОД обработке подлежат только те персональные данные, которые
        отвечают указанным в разделе 2 Политики целям их обработки. Персональные
        данные не подлежат обработке в случае несоответствия их характера и
        объема поставленным целям.
      </p>

      <p class="policy-privacy-text">
        3.5 В {{ project }} собираемые данные могут включать имя и фамилию
        пользователя, его организацию, контактные адрес электронной почты и
        телефон, страну проживания.
      </p>

      <p class="policy-privacy-text">
        3.6 Персональные данные, полученные оператором, предназначены только для
        внутреннего использования и не подлежат передачи третьим лицам.
      </p>
    </div>

    <div class="policy-privacy-wrapper">
      <div class="policy-privacy-subtitle">
        4. ПРИНЦИПЫ И УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
      </div>

      <p class="policy-privacy-text">
        4.1 Оператор производит обработку персональных данных при наличии хотя
        бы одного из следующих условий:
      </p>

      <ul>
        <li>
          <p class="policy-privacy-text">
            обработка персональных данных осуществляется с согласия субъекта
            персональных данных на обработку его персональных данных. О факте
            сбора персональных данных пользователь информируется на страницах
            сайта, где требуется указание таких данных. Обычно согласие
            выражается подтверждением соответствующего пункта на страницах
            программного комплекса;
          </p>
        </li>
        <li>
          <p class="policy-privacy-text">
            обработка персональных данных необходима для осуществления прав и
            законных интересов оператора для достижения общественно значимых
            целей при условии, что при этом не нарушаются права и свободы
            субъекта персональных данных;
          </p>
        </li>
        <li>
          <p class="policy-privacy-text">
            обработка персональных данных необходима для достижения целей,
            предусмотренных международным договором Российской Федерации или
            законом, для осуществления и выполнения возложенных
            законодательством Российской Федерации на оператора функций,
            полномочий и обязанностей;
          </p>
        </li>
      </ul>

      <p class="policy-privacy-text">
        4.2 Обработка персональных данных в {{ project }} осуществляется на
        основе следующих принципов:
      </p>

      <ul>
        <li>
          <p class="policy-privacy-text">законности и справедливой основы;</p>
        </li>
        <li>
          <p class="policy-privacy-text">
            уничтожения персональных данных по достижении целей их обработки.
            Персональные данные пользователя хранятся до тех пор, пока
            существует необходимость поддержания связи с ним, но будут
            незамедлительно удалены по его просьбе;
          </p>
        </li>
        <li>
          <p class="policy-privacy-text">
            недопущения обработки персональных данных, несовместимой с целями
            сбора персональных данных;
          </p>
        </li>
        <li>
          <p class="policy-privacy-text">
            обработки только тех персональных данных, которые отвечают целям их
            обработки;
          </p>
        </li>
        <li>
          <p class="policy-privacy-text">
            соответствия содержания и объёма обрабатываемых персональных данных
            заявленным целям обработки;
          </p>
        </li>
        <li>
          <p class="policy-privacy-text">
            осуществление мер предосторожности для защиты конфиденциальности
            персональных данных субъекта согласно порядку;
          </p>
        </li>
      </ul>

      <p class="policy-privacy-text">
        Оператор, получивший доступ к персональным данным, обязан не раскрывать
        третьим лицам и не распространять персональные данные без согласия
        субъекта персональных данных, если иное не предусмотрено федеральным
        законом.
      </p>
    </div>
  </div>
    </template>
  </PageWithScroll>
</template>

<script>
import PageWithScroll from "@/components/PageWithScroll"

export default {
  components: { PageWithScroll },
  computed: {
    project() {
      switch (process.env.VUE_APP_THEME) {
        case 'apok':
          return 'АПОК';
        case 'avim':
          return 'АВИМ';
        default:
          return 'КАТОД';
      }
    }
  }
};
</script>

<style lang="scss" scoped>
.policy-privacy {
  max-width: 80%;
  margin: 0 auto;

  &-title {
    color: #000;
    font-size: 32px;
    text-align: center;
  }

  &-wrapper {
    margin-top: 40px;
  }

  &-subtitle {
    font-size: 24px;
    margin-top: 20px;
  }

  &-text {
    font-size: 18px;
    margin-top: 20px;
  }
}
</style>
